# 图像
N, M = 80, 188  # 图片的高和宽
CUT = 1  # 裁剪最上面的多少行
PADDING = 1  # 舍弃左右边界的大小

# sobel
LRSTEP = 2
UDSTEP = 1
THRESHLOD = 100  # sobel的阈值

# 用于排除点的斜率范围
K_LOW = -0.2  # 斜率下限
K_HIGH = 1.5  # 斜率上限

# 拟合曲线
X_POS = 120  # 平移点的x位置
WIDTH = 27  # 赛道宽度

# 获取目标点
PI = 124.0
DIST = 40  # 垂足向上扩展的长度

# 路径生成
K_RHO = 4.5  # ρ增益
K_ALPHA = 12  # α增益
K_BETA = -3  # β增益

# 逆透视变换
SRCARR = [  # 原图上的四个点
    (0, 0),  # 左上角
    (0, 187),  # 右上角
    (79, 0),  # 左下角
    (79, 187),  # 右下角
]
PERARR = [  # 新图上的四个点
    (0, -10),  # 左上角
    (0, 250),  # 右上角
    (128, 90),  # 左下角
    (128, 155),  # 右下角
]

# 可视化
SRCZOOM = 5  # 原图放大倍数
N_, M_ = 130, 235  # 新图的高和宽
I_SHIFT = -50  # 新图向下平移
J_SHIFT = 0  # 新图向右平移
PERZOOM = 4  # 新图放大倍数
COLORS = ((255, 0, 255), (255, 0, 0), (0, 255, 255), (0, 255, 0), (0, 127, 127), (127, 127, 0))  # 画点的颜色
