# ImgProcess
N, M = 80, 188  # 图片的高和宽
CUT = 20  # 裁剪最上面的多少行
SRCZOOM = 5

NOISE = 5  # 灰度梯度最小有效值
H, W = 8, 35  # 框框的高和宽
PADDING = 1  # 舍弃左右边界的大小
DERI_THRESHOLD = 60000  # 小框内灰度梯度总和最小有效值
SUM_THRESHOLD = 30000  # 小框内灰度总和最小有效值

N_, M_ = 130, 235  # 新图的高和宽
I_SHIFT = 1  # 新图向下平移
J_SHIFT = 20  # 新图向右平移
PERZOOM = 4

SRCARR = [  # 原图上的四个点
    (0, 49),  # 左上角
    (0, 76),  # 右上角
    (59, 0),  # 左下角
    (59, 119),  # 右下角
]
PERARR = [  # 新图上的四个点
    (0, 49),  # 左上角
    (0, 86),  # 右上角
    (120, 49),  # 左下角
    (120, 86),  # 右下角
]
